# -*- coding: utf-8 -*-
"""
Created on Sun Aug  1 13:47:17 2021

@author: Maureen
"""

db_root_path = "E:/ubike_pred_db/"
csv_file_path = db_root_path + "csv_data/"
raw_file_path = db_root_path + "raw_data/"

raw_weather_web_path = raw_file_path + "weather_web_2021/"

csv_weather_web_path = csv_file_path + "weather_web_2021/"
csv_ubike_db_path = csv_file_path + "ubike_db_2021/"
csv_merged_db_web_path = csv_file_path + "merged_db_web_2021/"
csv_parsed_db_web_path = csv_file_path + "parsed_ubike_db_web_2021/"
csv_parsed_nor_db_web_path = csv_file_path + "parsed_normalized_ubike_db_web_2021/"
csv_parsed_nor_sparsed_db_web_path = csv_file_path + "parsed_normalized_ubike_db_web_2021/sparsed/"

code_path = "D:/git/youbike_prediction/"
result_path = code_path + "result/"
result_plot_path = result_path+"plot/"
result_plot_pred_path = result_plot_path + "predict_result/" 
arima_result_path = result_path + "statistic_csv/sarima_preidct_result/"
model_result_path = result_path + "model_result/"

ipython_path = code_path+"ipython/csv/"



weather_feature_s1 = ['CloudA','GloblRad','PrecpHour','SeaPres','UVI','Visb','WDGust','WSGust','td']
weather_feature_s2 = ['HUMD','H_24R','PRES','TEMP','WDIR','WDSE']
weather_feature_all = weather_feature_s1 + weather_feature_s2
weather_feature_used = ['PrecpHour','UVI','Visb','td', 'HUMD','H_24R','PRES','TEMP','comfort','WDSE']

weather_station_dict = {
    
    "466910" : {'id':"466910", 'name':'鞍部', 'coor': [121.5297,25.1825]},
    "466920" : {'id':"466920", 'name':'臺北', 'coor': [121.5148,25.0376]},
    "466930" : {'id':"466930", 'name':'竹子湖', 'coor': [121.5445,25.1620]},    
  
    "C0A980" : {'id':"C0A980", 'name':'社子', 'coor': [121.4696,25.1095]},
    "C0A9E0" : {'id':"C0A9E0", 'name':'士林', 'coor': [121.5030,25.0903]},
    "C0A9F0" : {'id':"C0A9F0", 'name':'內湖', 'coor': [121.5755,25.0794]},   
    
    "C0AH40" : {'id':"C0AH40", 'name':'平等', 'coor': [121.5771,25.1291]},
    "C0AH70" : {'id':"C0AH70", 'name':'松山', 'coor': [121.5504,25.0487]},
    "C0AI40" : {'id':"C0AI40", 'name':'石牌', 'coor': [121.5132,25.1156]},   
    
    "C0AC40" : {'id':"C0AC40", 'name':'大屯山', 'coor': [121.5224,25.1757]},
    "C0AC70" : {'id':"C0AC70", 'name':'信義', 'coor': [121.5645,25.0378]},
    "C0AC80" : {'id':"C0AC80", 'name':'文山', 'coor': [121.5757,25.0023]},   
    "C0A9C0" : {'id':"C0A9C0", 'name':'天母', 'coor': [121.5371,25.1174]},   
}

weather_station_list = [
    
    {'id':"466910", 'name':'鞍部', 'coor': [121.5297,25.1825]},
    {'id':"466920", 'name':'臺北', 'coor': [121.5148,25.0376]},
    {'id':"466930", 'name':'竹子湖', 'coor': [121.5445,25.1620]},    
  
    {'id':"C0A980", 'name':'社子', 'coor': [121.4696,25.1095]},
    {'id':"C0A9E0", 'name':'士林', 'coor': [121.5030,25.0903]},
    {'id':"C0A9F0", 'name':'內湖', 'coor': [121.5755,25.0794]},   
    
    {'id':"C0AH40", 'name':'平等', 'coor': [121.5771,25.1291]},
    {'id':"C0AH70", 'name':'松山', 'coor': [121.5504,25.0487]},
    {'id':"C0AI40", 'name':'石牌', 'coor': [121.5132,25.1156]},   
    
    {'id':"C0AC40", 'name':'大屯山', 'coor': [121.5224,25.1757]},
    {'id':"C0AC70", 'name':'信義', 'coor': [121.5645,25.0378]},
    {'id':"C0AC80", 'name':'文山', 'coor': [121.5757,25.0023]},   
    {'id':"C0A9C0", 'name':'天母', 'coor': [121.5371,25.1174]},   
]


ignore_list = [15, 20, 160, 198, 199, 200] # no station
ignore_list2 = [28, 47, 58, 69, 99, 101 ,106, 124 ,153 , 168, 174 ,185 ,190 ,229,237 ,239,240 ,264 ,306 ,311 ,313,330,346,378,382,383,387]
ignore_list3 = [31,79,95,124,170,174,237,390]
station_sno_list = list(set(range(1,405)) - set(ignore_list) - set(ignore_list2) - set(ignore_list3))

if True:
    small_sno = [39, 53, 69, 130, 172, 196, 205, 234, 239, 262, 264, 271, 280, 290, 295, 297, 300, 301, 320, 323, 324, 327, 330, 333, 334, 336, 340, 347, 348, 349, 354, 357, 372, 383, 388, 393, 395, 396, 402, 403]
    big_sno = [1, 4, 5, 6, 7, 8, 21, 26, 30, 36, 61, 82, 83, 88, 103, 115, 119, 121, 132, 134, 143, 148, 149, 162, 163, 165, 176, 186, 202, 210, 215, 288, 405]
    mid_sno = [2, 3, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 22, 23, 24, 25, 27, 28, 29, 31, 32, 33, 34, 35, 37, 38, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 54, 55, 56, 57, 58, 59, 60, 62, 63, 64, 65, 66, 67, 68, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 84, 85, 86, 87, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 116, 117, 118, 120, 122, 123, 124, 125, 126, 127, 128, 129, 131, 133, 135, 136, 137, 138, 139, 140, 141, 142, 144, 145, 146, 147, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 161, 164, 166, 167, 168, 169, 170, 171, 173, 174, 175, 177, 178, 179, 180, 181, 182, 183, 184, 185, 187, 188, 189, 190, 191, 192, 193, 194, 195, 197, 201, 203, 204, 206, 207, 208, 209, 211, 212, 213, 214, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 235, 236, 237, 238, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 263, 265, 266, 267, 268, 269, 270, 272, 273, 274, 275, 276, 277, 278, 279, 281, 282, 283, 284, 285, 286, 287, 289, 291, 292, 293, 294, 296, 298, 299, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 321, 322, 325, 326, 328, 329, 331, 332, 335, 337, 338, 339, 341, 342, 343, 344, 345, 346, 350, 351, 352, 353, 355, 356, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 384, 385, 386, 387, 389, 390, 391, 392, 394, 397, 398, 399, 400, 401, 404]
    #small_sno = [39, 130, 205, 262, 280, 297, 320, 327, 334, 347, 354, 383, 395, 403]
    #big_sno = [1, 6, 21, 36, 83, 115, 132, 148, 163, 186, 215]
    #mid_sno = [2, 18, 32, 44, 55, 66, 77, 90, 100, 111, 124, 137, 150, 161, 175, 187, 201, 214, 225, 236, 247, 257, 269, 281, 293, 307, 317, 332, 346, 361, 371, 382, 397]
else:
    small_sno = [39, 130, 205, 262, 280]
    big_sno = [1, 6, 21, 36, 83]
    mid_sno = [2, 18, 32, 44, 55, 66, 77, 90, 100, 111]
   
small_station_sno_list = list(set(small_sno + big_sno + mid_sno) - set(ignore_list) - set(ignore_list2))


